Repository: 84000/data-translation-memory
Catalog: toh192_84000-the-prophecy-of-ksemavati.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བདེ་ལྡན་མ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Prophecy of Kṣemavatī

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་ཉི་ཁྲིའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was residing in Rājagṛha on Vulture Peak together with a large monastic congregation of twenty thousand monks and many bodhisattva great beings including Maitreya and Mañjuśrī.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཆོས་གོས་དང་ཤམ་ཐབས་གསོལ་ཏེ། ལྷུང་བཟེད་བསྣམས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ལ་གཤེགས་སོ།
en: At dawn, the Blessed One donned his robes, picked up his alms bowl, and, together with the bodhisattva great being Maitreya, went to the city of Rājagṛha for alms.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་དུ་མཐར་ཆགས་ཀྱིས་བསོད་སྙོམས་རྒྱུ་ཞིང་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་ཕོ་བྲང་ག་ལ་བ་དེར་གཤེགས་སོ།
en: As they progressed through their rounds in the city of Rājagṛha, they neared the palace of King Bimbisāra.

source: །དེ་ནས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ཞེས་བྱ་བ་ཁང་བཟངས་མཆོག་གི་སྟེང་ན་འདུག་པས་བཅོམ་ལྡན་འདས་ཐག་རིང་པོ་ནས་གཤེགས་པ་མཐོང་ངོ་།
en: From atop the royal residence, King Bimbisāra’s queen, Kṣemavatī, could see the Blessed One approaching from a distance.

source: །མཐོང་ནས་ཀྱང་སེམས་དགའ་བར་གྱུར་ཏེ། ཁང་བཟངས་ཀྱི་སྟེང་ནས་བབས་ནས། བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་གདན་དར་དཀར་རིན་ཆེ་བ་བཏིང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་གདན་བཤམས་པ་ལ་བཞུགས་སོ།
en: Filled with joy at the sight of the Blessed One, Kṣemavatī descended from the palace and laid out ornate cushions made of white silk for the Blessed One and the bodhisattva great being Maitreya.

source: །དེ་ནས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་ཞེ་ས་དང་བཅས།
en: The Blessed One and the bodhisattva great being Maitreya seated themselves on the seats that had been prepared for them, and Kṣemavatī, bedecked in all her jewelry, bowed her head at their feet.

source: གུས་པ་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: So that she might hear teachings on the Dharma, she sat before the Blessed One with great respect and reverence for him.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ལ་གཟིགས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་མཁྱེན་བཞིན་དུ་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One saw Queen Kṣemavatī bedecked in all her jewelry and, although he knew the answer, addressed her in order to benefit all beings.

source: བདེ་ལྡན་མ་གང་ལུས་ལ་ཐོགས་པའི་འབྲས་བུ་འདི་ལྟ་བུ་ཤིན་ཏུ་ལྷམ་མེ་ལྷན་ནེ་ལྷ་ངེར་འདུག་པའི་ཤིང་དེའི་མིང་ཅི་ཞེས་བྱ།
en: He asked, “Kṣemavatī, what is the name of the tree that bears the kind of brilliant, dazzling, shining fruit that adorns your body?”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Queen Kṣemavatī answered the Blessed One with the following verses: “The great being has asked,

source: གང་གི་འབྲས་བུ་ཁྱོད་ཐོགས་པ། །ཤིང་དེའི་མིང་ནི་ཅི་ཡིན་ཞེས།
en: ‘What is the name of the tree That bears the fruit you wear?’

source: །དཔའ་བོ་ཆེན་པོ་མཁྱེན་བཞིན་དུ།
en: Even though, great hero, you already know.

source: །གང་ཟག་མཆོག་གིས་རྨས་པ་ནི།
en: “It is called the tree arisen from the merit

source: །བདག་གིས་སྔོན་ནི་གང་བསྐྱེད་པ། །བསོད་ནམས་ལས་བྱུང་ཤིང་ཞེས་བགྱི།
en: Generated in the past

source: །འདྲེན་པ་བདག་གིས་མྱོང་བ་ཡི།
en: Guide, these fruits I now enjoy

source: །འབྲས་བུ་འདི་དག་དེ་ཡི་ལགས།
en: Are from a tree such as that.

source: །ལྗོན་ཤིང་བཤད་པ་དེ་ཉིད་ཀྱང་།
en: “This very same fruit tree

source: །སངས་རྒྱས་ཉན་ཐོས་རྣམས་ལ་ཡོད།
en: Belongs to disciples of the Buddha.

source: །སངས་རྒྱས་ཡེ་ཤེས་འཐོབ་འདོད་རྣམས།
en: Those who wish to obtain the wisdom of a buddha

source: །བྱང་ཆུབ་ཕྱིར་ནི་དེ་ལ་གནས།
en: Sit before it in order to awaken.

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་ཆབ་སྩལ་བས།
en: “Watered with generosity and discipline,

source: །ལྗོན་ཤིང་དེ་ནི་རྣམ་པར་བསྲུངས།
en: This fruit tree has been well tended.

source: །དེ་ནི་རྣམ་པར་འཁྲུངས་པ་ན།
en: And when it fully blossoms,

source: །འབྲས་བུ་བཟང་པོ་རྣམས་ཀྱང་འབྱུང་།
en: It will bear sublime fruits.

source: །བཟོད་པ་དང་ནི་བརྩོན་འགྲུས་མཐུས།
en: “With the powers of patience and diligence,

source: །ལྗོན་ཤིང་བདག་གིས་ལེགས་པར་བསྲུངས།
en: I have carefully tended this fruit tree,

source: །འབྲས་བུ་དྲི་མེད་འབྱུང་བར་འགྱུར།
en: It will bear flawless fruits.

source: །ཤིང་འདི་བལྟ་ན་མཛེས་པ་སྟེ།
en: “This tree is beautiful to behold,

source: །བསམ་གཏན་ཤེས་རབ་མེ་ཏོག་རྒྱས།
en: Covered with flowers of concentration and insight.

source: །འདྲེན་པ་བདག་གིས་དེ་དག་གི།
en: Guide, all that I enjoy

source: །འབྲས་བུ་རྣམས་ནི་མྱོང་བ་ལགས།
en: Is the fruit of that tree. “Just like trees

source: །ཇི་ལྟར་རི་ལ་རྟེན་པ་ཡི།
en: Rooted in the mountains

source: །ཤིང་རྣམས་ཡལ་ག་ལོ་མ་དག །ཆུ་ཞེང་གབ་པར་རྒྱ་ཆེ་བ།
en: Have outstretched limbs and leaves

source: །འཕེལ་བར་གྱུར་ཏེ་བསྐྱོད་མི་ནུས།
en: That they spread far and wide without moving, “In that way I carefully tended

source: །དེ་བཞིན་ལྗོན་ཤིང་ཆེ་བཟང་འདི།
en: This excellent broad fruit tree in the past

source: །སངས་རྒྱས་ཆོས་ཉིད་འཚལ་བས་ན།
en: By seeking the essence of buddhahood

source: །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །སྔོན་ནི་ལེགས་པར་བསྲུངས་པ་ལགས།
en: With the aim of benefiting all beings.

source: །འདྲེན་པའི་བསོད་ནམས་ལྗོན་ཤིང་འདིའི།
en: “Guide, this tree of merit

source: །འབྲས་བུ་གཞན་ཡང་མཆིས་ལགས་ཏེ།
en: Will have many more fruits besides.

source: །བདག་གིས་ཉམས་སུ་མྱོང་བ་འདི།
en: I will experience more

source: །དེ་ཡི་མེ་ཏོག་ཙམ་དུ་བས།
en: Than the mere flowers. “I will attain the fruits of that tree—

source: །དེ་ཡི་འབྲས་བུ་བྱང་ཆུབ་མཆོག །སངས་རྒྱས་བྱང་ཆུབ་བླ་མེད་ལགས། །དེ་ནི་བདག་གིས་ཐོབ་པར་འགྱུར།
en: Supreme awakening, The unsurpassed awakening of a buddha.

source: །སྨད་པ་བུད་མེད་ཉིད་སྤངས་ནས།
en: When I leave this lowly station of womanhood behind,

source: །སྐྱེས་པར་བདག་ཉིད་འགྱུར་བ་ལགས།
en: “I will be reborn as a man

source: །སེམས་ཅན་ཀུན་གྱི་དམ་པ་མཆོག །ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་ཕྱིན།
en: Who is sublime among all beings, Has perfected all qualities,

source: །ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས།
en: And is all-knowing and all-seeing. “I will liberate those beings

source: །སྡུག་བསྔལ་ཀུན་གྱིས་ཉེན་པ་ཡི།
en: Who are oppressed by suffering,

source: །སེམས་ཅན་རྣམས་ནི་བདག་གིས་དགྲོལ།
en: And become a compassionate refuge

source: །འཇིག་རྟེན་ཀུན་ལ་སྙིང་བརྩེ་བའི། །སྐྱབས་སུ་བདག་ནི་འགྱུར་བ་ལགས། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལ་བཀའ་སྩལ་པ།
en: For the denizens of the world.”

source: བདེ་ལྡན་མ་གང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ཚོགས་ཀྱི་དོན་དང་། ལྷ་རྣམས་དང་། མི་རྣམས་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The Blessed One responded, “Kṣemavatī, you have acted to bring benefit and happiness to many people and have compassion for the world. You have acted for the sake of the vast assembly of beings, for the happiness and benefit of gods and humans alike. Excellent, excellent indeed!”

source: །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་འདི་རྣམས་ཅི་ལས་གྲུབ་ལགས།
en: “Blessed One,” Queen Kṣemavatī replied, “the Blessed One has the thirty-two major and eighty minor bodily marks of a great being, the ten powers of the thus-gone ones, the four fearlessnesses, the four special modes of knowledge, the eighteen unique qualities of a buddha, great loving-kindness, great compassion, great joy, and great equanimity. Where do all of your qualities come from?

source: དེ་བཞིན་དུ་གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མ་མཆིས་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མ་མཆིས་པ་དང་། བརྗོད་དུ་མ་མཆིས་པ་དང་། བགྲང་བ་ལས་འདས་པ་རྣམས་ཅི་ལས་གྲུབ་ལགས།
en: And, furthermore, where do the unfathomable, inconceivable, immeasurable, ineffable, incalculable qualities of the Buddha come from?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One answered Queen Kṣemavatī with these verses:

source: སངས་རྒྱས་ཡེ་ཤེས་འདོད་པས་ན། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར།
en: “Desiring the wisdom of the buddhas In order to benefit all beings,

source: །ངས་ཀྱང་འདི་ལྟར་ལྗོན་པའི་ཤིང་། །སྔོན་ནི་ལེགས་པ་ཁོ་ནར་བསྐྱེད།
en: I too, in the past, have done nothing But carefully tend such a tree.

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་པ་དང་། །དེ་བཞིན་བརྩོན་འགྲུས་བསམ་གཏན་བསགས།
en: “I gathered generosity, discipline, patience, And likewise diligence and concentration.

source: །ཡུན་རིང་དུས་ནས་ཏིང་འཛིན་དང་། །ཤེས་རབ་ངེས་པར་བསྟེན་པ་ཡིན།
en: For a long time, I applied myself To absorption and insight.

source: །སེམས་ཅན་རྣམས་ལ་མི་མཉམ་སེམས། །ངས་ནི་བསྒོམས་པར་མི་དྲན་ཏེ།
en: “Beings have biased minds,

source: །རྟག་ཏུ་སེམས་ནི་མཉམ་གྱུར་པས།
en: Yet my mind is impartial Without needing to be cultivated.

source: །སངས་རྒྱས་ཉིད་ནི་ངས་བརྙེས་སོ།
en: Thus I discovered buddhahood itself.

source: །ང་ཡི་སེམས་ནི་མཉམ་པ་ཡིས།
en: “With an impartial mind That equalizes

source: །རྟག་ཏུ་སྡུག་དང་མི་སྡུག་དང་། །མཛའ་དང་མི་མཛའ་སྙོམས་པས་ན།
en: Beauty and ugliness, friend and foe,

source: །བསོད་ནམས་ཤིང་ནི་རྣམ་པར་བསྐྱེད།
en: I grew the tree of merit.

source: །དེས་ན་ལྗོན་ཤིང་ཆེན་པོ་འདི།
en: “As a result, this broad tree

source: །ཡོན་ཏན་མང་པོར་གྱུར་པ་ཡིན།
en: Gained many excellent qualities.

source: །འཁོར་ལོས་སྒྱུར་ཉིད་ངས་ཐོབ་སྟེ།
en: I attained the state of a universal monarch

source: །བརྒྱ་བྱིན་ཉིད་ཀྱང་བྱས་པ་ཡིན།
en: And the level of Śakra.

source: །རྣམ་མང་དབང་ཕྱུག་ཆེན་པོ་དང་། །ཚངས་པ་ཉིད་ཀྱང་དེ་ལས་ཐོབ། །བསམ་གྱིས་མི་ཁྱབ་སངས་རྒྱས་ཆོས།
en: “I surpassed the many-formed Maheśvara,

source: །མཚན་ཉིད་དག་ཀྱང་ངས་རྟོགས་སོ།
en: And even Brahmā himself. I realized the characteristics Of the inconceivable features of buddhahood.”

source: །དེ་ནས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མས་བཅོམ་ལྡན་འདས་ཀྱི་ཡོན་ཏན་རྣམས་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་པར་རབ་ཏུ་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དེ་རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: After hearing of the qualities of the Blessed One, Queen Kṣemavatī praised the Blessed One’s well-spoken teaching and rejoiced, offering these verses:

source: ཇི་ལྟར་མི་མཆོག་དམ་པ་པོ།
en: “Just as the supreme human, the excellent one,

source: །ཡོན་ཏན་རྒྱ་མཚོ་མཐའ་ཡས་པས།
en: With his endless ocean of qualities,

source: །སྔོན་ནི་སྤྱོད་པ་ཤིན་ཏུ་བསླབས།
en: Trained his conduct in the past,

source: །དེ་ལྟར་བདག་ཀྱང་རྗེས་སུ་སློབ།
en: So will I train.

source: །ཡོན་ཏན་མཐར་ཕྱིན་ཁྱོད་ཀྱི་ནི།
en: “As you have perfected all qualities,

source: །ཡོན་ཏན་རྣམས་ལྟར་བདག་སློབ་སྟེ།
en: I train to emulate your qualities.

source: །སྲིད་པར་སྡུག་བསྔལ་སྤངས་ནས་ནི།
en: Abandoning the suffering of existence,

source: །བདག་ཀྱང་འདི་འདྲར་འགྱུར་བར་བགྱི།
en: I too will become like that. “I fully dedicate All the generosity I cultivate

source: །ཚེ་རབས་གཞན་ནི་མ་ལུས་པར། །བདག་གིས་སྦྱིན་པ་གང་སྩལ་པ།
en: In all my subsequent lives

source: །མཉམ་མེད་ཡེ་ཤེས་འཐོབ་སླད་དུ།
en: To the attainment of unparalleled wisdom.

source: །དེ་དག་ཐམས་ཅད་ཡོངས་སུ་བསྔོ།
en: “I fully dedicate All the discipline I maintain

source: །སྲིད་པ་འདི་འམ་གཞན་དག་ཏུ། །བདག་གིས་ཚུལ་ཁྲིམས་གང་བསྲུངས་པ།
en: In this life and any other

source: །སངས་རྒྱས་ཡེ་ཤེས་འཐོབ་སླད་དུ།
en: To the attainment of the wisdom of the buddhas.

source: །བཟོད་དང་བརྩོན་འགྲུས་ཏིང་འཛིན་དང་། །ཤེས་རབ་དགེ་བ་གང་བསྟེན་པ།
en: All the patience, diligence, absorption, Insight, and virtue I cultivate

source: །སངས་རྒྱས་ཆོས་ཀྱི་དོན་གྱི་ཕྱིར།
en: To be of benefit to the Buddha’s teachings.

source: །དེ་དག་ཐམས་ཅད་བདག་གིས་བསྔོ།
en: “All the virtuous deeds I accrue

source: །ལུས་དང་ངག་དང་ཡིད་རྣམས་ཀྱིས། །ལས་དགེ་གང་དག་བདག་གིས་བསགས།
en: Through body, speech, and mind I dedicate to awakening,

source: །སངས་རྒྱས་ཡེ་ཤེས་ཡོན་ཏན་ཕྱིར། །བྱང་ཆུབ་ཏུ་ནི་བདག་གིས་བསྔོ།
en: For the sake of the wisdom and qualities of the buddhas.

source: །བུད་མེད་ལུས་འདི་སྤངས་ནས་ནི།
en: “May I leave this woman’s body behind

source: །སྐྱེས་པ་མཆོག་ཏུ་བདག་གྱུར་ཅིག །དེ་ལྟར་སྐྱེས་པའི་ལུས་ཐོབ་ནས།
en: And take the supreme form of a man. Upon attaining the body of a man,

source: །དམ་པའི་མཆོག་ཏུ་བདག་གྱུར་ཅིག །དེ་ལྟར་གྱུར་ནས་བདེ་གཤེགས་ཀྱི།
en: May I become the most sublime of beings. “Once that has come to pass, I will turn

source: །འཁོར་ལོ་བླ་མེད་བསྐོར་བར་བགྱི། །འཁོར་བའི་བཙོན་རར་བཅིངས་པ་ཡི།
en: The unsurpassed wheel of the well-gone ones.

source: །སེམས་ཅན་བྱེ་བ་དགྲོལ་བར་བགྱི།
en: I will free the masses of beings Who are trapped in the prison of saṃsāra.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then offered his approval to Queen Kṣemavatī with this verse:

source: ཚིག་འདི་སྨྲས་པ་ལེགས་པ་ཡིན།
en: “Those words were well spoken,

source: །སེམས་ནི་རབ་ཏུ་སྡོམ་པ་ལེགས།
en: Your mind is well disciplined,

source: །ཁྱོད་ཀྱིས་བདུད་ནི་ལེགས་པར་མནན།
en: And you have subdued Māra well!

source: །རྫོགས་སངས་རྒྱས་སུ་ཁྱོད་འགྱུར་རོ།
en: You will awaken to perfect buddhahood!”

source: །དེ་ནས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་དགའ་ཞིང་མགུ་ལ་རབ་ཏུ་དགའ་བ་དང་། དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་བཟའ་བ་དང་བཅའ་བ་མང་པོས་ཚིམ་པར་བྱས་སོ།
en: Queen Kṣemavatī was joyful, elated, and jubilant. Filled with joy and delight, she offered the Blessed One and the bodhisattva great being Maitreya plenty of food and drink until they were satisfied.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་བསྩང་སྡེར་ནི་གྱུ། ཕྱག་ནི་བཅབས་ནས་རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་ལ་ཆོས་ཀྱི་གཏམ་རྒྱས་པས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ལུང་བསྟན་ཏེ།
en: After the Blessed One put away his bowl and washed his hands, he gave Queen Kṣemavatī extensive Dharma teachings, encouraged her to uphold them, inspired her, delighted her, and then made this prophecy:

source: བདེ་ལྡན་མ་ཁྱོད་མ་འོངས་པའི་དུས་བསྐལ་པ་དུ་མ་ཞིག་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: “In the future, Kṣemavatī, many eons from now, you will become a thus-gone, worthy, perfected buddha, a teacher for gods and humans.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་རིན་ཆེན་དཔལ་ཞེས་བྱ་བར་འགྱུར་རོ། །ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་མཆོག་ཏུ་ཡོངས་སུ་དག་པར་འགྱུར་ཏེ།
en: You will be a blessed buddha known as Guṇaratnaśrī, and your buddha field will be supremely pure.

source: ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བའི་སྡུག་བསྔལ་མེད་པ་ཡིད་དུ་འོང་བ་ཡིད་དང་འཐད་པ་མཆོག་ཏུ་རྣམ་པར་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གནས་ཡིན་ཏེ།
en: It will be free of the suffering of descending to lower rebirths and the lower realms. It will be an abode of beautiful, pleasant, and supremely pure bodhisattvas.

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་དེ་ལྟ་བུར་འགྱུར་རོ།
en: Such will be your buddha field.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་དགེ་བསྙེན་མ་སྟོང་ཕྲག་མང་པོ་ཞིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: As this teaching was given, many thousands of laywomen developed the intent to reach unexcelled, perfect awakening.

source: །སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དང་། ལྷ་དང་མིའི་སྐྱེ་དགུ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་སྣང་བ་ཐོབ་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Thousands of beings and many gods and humans obtained the light of the Dharma.

source: རྒྱལ་པོའི་བཙུན་མོ་བདེ་ལྡན་མ་དང་། འཁོར་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: When the Blessed One had finished speaking, Queen Kṣemavatī, her retinue, and the entire world with its gods, humans, asuras, and gandharvas all rejoiced and praised what the Buddha had taught.

source: འཕགས་པ་བདེ་ལྡན་མ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།།
en: This concludes the noble Mahāyāna sūtra “ The Prophecy of Kṣemavatī
